■ R 이란 무엇인가?
  뉴질랜드의 aukland 대학의 robert gentleman과 ross ihaka가 1995년에 개발한 소프트웨어 입니다. 데이터 분석을 위한 통계 및 시각화를 지우너하는 무료 소프트웨어 입니다.

파이썬과 비교해서 장점? 데이터 시각화가 특징이다.


■ R 을 통해서 배워야 하는 큰그림
1. 탐색적 데이터 분석 : 현상에 패턴을 발견하는 것 (하둡 리눅스 포트폴리오)
2. 통계적 추론 : 현상에서 인과적인 결론을 도출하는것 (통계 스터디 : 추정, 검정)
3. 기계학습 (머신러닝) : 현상을 예측하는 것 (R 수업, 캐글 상위권 도전)

캐글(kaggle) ?  전 세계 데이터 분석가들이 특정 데이터 분석 주제를 두고 선의의 경쟁을 해서 좋은 데이터 분석에 대해서 순위를 부여하고 상금도 주고 취업할 때 스카웃 제의도 생기게 하는 구글에 인수된 회사


■ R 을 왜 사용해야 하는가?
  1. 무료오픈소스이다.
2. data 분석을 위해서 가장 많이 사용하는 통계 플랫폼
3. 복잡한 데이터를 다양한 그래프로 표현
4. 분석을 위한 데이터를 쉽게 저장하고 조작
5. 누구든지 유용한 패키지를 공유할 수 있고 새로운 기능에 대한 전파가 빠르다.
6. 어떤 os 에도 설치가 가능 (심지어 아이폰에도 설치할 수 있습니다.)

구글의 코랩을 이용하면 GPU를 사용해서 파이썬 코드를 무료로 수행할 수 있는 장점이 있는데 이 코랩에서 R코드도 지원합니다.
