# 1장. 통계학의 이해

# 1.1 통계학의 활용

# 통계학의 정의와 분류
#  - 통계학 : 불확실하고 잘 알려져 있지 않은 사실과 대상에 대한 통계정보를 얻기 위해 이와 관련된 자료(data)를 수집하고 그 자료를 요약 정리하여 해석하며, 의사결정을 위한 결론이나 일반성 등을 이끌어내는 데 필요한 이론과 방법을 과학적으로 제시하여 주는 학문
#  - 활용의 예 : 실업률, 농산물 수요 및 소비자 가격, 물가 안정, 지지도 조사 등
#  - 기술통계학 : 자료를 정리하여 그림이나 표로 요약하거나 자료들의 수치값을 요약한 대표값이나 자료의 흩어진 형태(분포)와 변동의 크기 등을 구하는 분야
#  - 추측통계학 : 통계적 모형과 구간을 설정하기도 하고 추측하기도 하며 어떤 기존의 사실에 대하여 가설을 세우고 이름 검정하고 예측하는 분야

# 1.2 자료의 수집
# - 모집단(population) : 통계조사의 관심이 되는 모든 대상들의 집합
# - 모수(parameter) : 모집단의 특성을 나타내는 수치
# - 표본(sample) : 조사를 위해 선정된 집합
# - 통계량(statistics) : 표본이 특성을 나타내는 수치


# 1.3 자료의 이해
# 자료의 종류
# 1) 양적자료
# - 연속형자료(continuous data) : 관측값들이 셀 수 없는 연속적인 구간의 값을 취하는 경우 (예 : 키)
# - 이산형자료(discrete data) : 관측값들이 셀 수 있는 값을 취하는 경우 (예 : 입장인원 수)
# 2) 질적자료
# - 순위자료(ordinal data) : 순서상의 의미가 있는 경우 (예 : 선호도)
# - 명목자료(nominal data) : 질적자료를 단순히 구분하기 위한 경우 (예 : 성별)